Revit 2025 API
ElectricalSystem Properties
The ElectricalSystem type exposes the following members.
Properties
Name | Description
ApparentCurrent |  The ApparentCurrent value of the Electrical System.
ApparentCurrentPhaseA |  The ApparentCurrentPhaseA value of the Electrical System.
ApparentCurrentPhaseB |  The ApparentCurrentPhaseB value of the Electrical System.
ApparentCurrentPhaseC |  The ApparentCurrentPhaseC value of the Electrical System.
ApparentLoad |  The ApparentLoad value of the Electrical System.
ApparentLoadPhaseA |  The ApparentLoadPhaseA value of the Electrical System.
ApparentLoadPhaseB |  The ApparentLoadPhaseB value of the Electrical System.
ApparentLoadPhaseC |  The ApparentLoadPhaseC value of the Electrical System.
AssemblyInstanceId |  The id of the assembly instance to which the element belongs.
(Inherited from Element)
BalancedLoad |  Reports whether the BalancedLoad is on or off.
BaseEquipment | The base panel or equipment of the system.
(Inherited from MEPSystem)
BaseEquipmentConnector | The connector within base equipment which is used to connect with system.
(Inherited from MEPSystem)
BoundingBox | Retrieves a box that circumscribes all geometry of the element.
(Inherited from Element)
Category | Retrieves a Category object that represents the category or sub category in which the element resides.
(Inherited from Element)
CircuitConnectionType |  The circuit connection type of the electrical system.
CircuitNamingIndex |  The Circuit Naming Index where the Electrical System is located in its panel. The Circuit Naming Index is used to retrieve the Circuit Naming Index of the Electrical System.
CircuitNumber |  The CircuitNumber of the Electrical System.
CircuitPathMode |  The circuit path mode of the electrical system.
CircuitType |  The circuit type of the Electrical System.
ConnectorManager | Connector manager of the system.
(Inherited from MEPSystem)
CreatedPhaseId |  Id of a Phase at which the Element was created.
(Inherited from Element)
DemolishedPhaseId |  Id of a Phase at which the Element was demolished.
(Inherited from Element)
DesignOption | Returns the design option to which the element belongs.
(Inherited from Element)
Document | Returns the Document in which the Element resides.
(Inherited from Element)
Elements | Terminal elements in the system.
(Inherited from MEPSystem)
Frame |  The Frame value of the Electrical System.
Geometry | Retrieves the geometric representation of the element.
(Inherited from Element)
GroundConductorsNumber |  The GroundConductors Number of the Electrical System.
GroupId |  The id of the group to which an element belongs.
(Inherited from Element)
HasCustomCircuitPath |  Checks whether the electrical system circuit path has been customized. If not, the property CircuitPathMode cannot be set as Custom explicitly.
HasDesignParts |  Indicates if the system has one or more design parts.
(Inherited from MEPSystem)
HasFabricationParts |  Indicates if the system has one or more fabrication parts.
(Inherited from MEPSystem)
HasPathOffset |  Whether the circuit path has a valid offset.
HasPlaceholders |  Indicates if the system has one or more placeholders.
(Inherited from MEPSystem)
HotConductorsNumber |  The HotConductors Number of the Electrical System.
Id |  A unique identifier for an Element in an Autodesk Revit project.
(Inherited from Element)
IsBasePanelFeedThroughLugsOccupied |  Checks if the feed through lugs of the base panel is already occupied.
IsEmpty |  Indicates if the system is empty or not.
(Inherited from MEPSystem)
IsModifiable |  Identifies if the element is modifiable.
(Inherited from Element)
IsMultipleNetwork |  Indicates if the system is well connected or not. The flag will enable the "Divide System" button.
(Inherited from MEPSystem)
IsTransient |  Indicates whether an element is transient or permanent.
(Inherited from Element)
IsValid |  Indicates if the system is valid or not. atom AtomValidateSystem default false
(Inherited from MEPSystem)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from Element)
Length |  The Length value of the Electrical System.
LevelId |  The id of the level associated with the element.
(Inherited from Element)
LoadClassificationAbbreviations |  The LoadClassification Abbreviations used in the Electrical System.
LoadClassifications |  The LoadClassifications used in the Electrical System.
LoadName |  The LoadName of the Electrical System.
Location | This property is used to find the physical location of an element within a project.
(Inherited from Element)
Name | A human readable name for the Element.
(Inherited from Element)
NeutralConductorsNumber |  The NeutralConductors Number of the Electrical System.
OwnerViewId |  The id of the view that owns the element.
(Inherited from Element)
PanelName |  The Panel name of the Electrical System.
Parameter[BuiltInParameter] | Retrieves a parameter from the element given a parameter id.
(Inherited from Element)
Parameter[Definition] | Retrieves a parameter from the element based on its definition.
(Inherited from Element)
Parameter[Guid] | Retrieves a parameter from the element given a GUID for a shared parameter.
(Inherited from Element)
Parameters | Retrieves a set containing all of the parameters that are contained within the element.
(Inherited from Element)
ParametersMap | Retrieves a map containing all of the parameters that are contained within the element.
(Inherited from Element)
PathOffset |  The offset of the horizontal segments of the circuit path.
PhaseLabel |  The circuit phase label used in the Electrical System.
Pinned |  Identifies if the element has been pinned to prevent changes.
(Inherited from Element)
PolesNumber |  The Poles Number of the Electrical System.
PowerFactor |  The PowerFactor value of the Electrical System.
PowerFactorState |  The PowerFactorState type of the Electrical System.
PressureLossOfCriticalPath |  The total pressure loss of the sections in critical path.
(Inherited from MEPSystem)
Rating |  The Rating value of the Electrical System.
RunsNumber |  The Runs Number of the Electrical System.
SectionsCount |  The number of sections.
(Inherited from MEPSystem)
SlotIndex |  The Slots where the Electrical System is located in its panel.
StartSlot |  The Start Slot where the Electrical System is located in its panel.
SystemType |  The Electrical System Type of the Electrical System.
TrueCurrent |  The TrueCurrent value of the Electrical System.
TrueCurrentPhaseA |  The TrueCurrentPhaseA value of the Electrical System.
TrueCurrentPhaseB |  The TrueCurrentPhaseB value of the Electrical System.
TrueCurrentPhaseC |  The TrueCurrentPhaseC value of the Electrical System.
TrueLoad |  The TrueLoad value of the Electrical System.
TrueLoadPhaseA |  The TrueLoadPhaseA value of the Electrical System.
TrueLoadPhaseB |  The TrueLoadPhaseB value of the Electrical System.
TrueLoadPhaseC |  The TrueLoadPhaseC value of the Electrical System.
UniqueId |  A stable unique identifier for an element within the document.
(Inherited from Element)
VersionGuid |  Get the element version Guid.
(Inherited from Element)
ViewSpecific |  Identifies if the element is owned by a view.
(Inherited from Element)
Voltage |  The Voltage value of the Electrical System.
VoltageDrop |  The VoltageDrop value of the Electrical System.
Ways |  The circuit ways used in the Electrical System.
WireSizeString |  The WireSize as a String of the Electrical System
WireType |  The wire type of the Electrical System.
WorksetId |  Get Id of the Workset which owns the element.
(Inherited from Element)
Top
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace